dataset_gen/NS_datasets/LDC/Multiple_Hole/test_Design_Point_0_copy_1/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
16064
(
(0.0078125 0.0078125 0.05)
(0.0234375 0.0078125 0.05)
(0.0390625 0.0078125 0.05)
(0.0546875 0.0078125 0.05)
(0.0703125 0.0078125 0.05)
(0.0859375 0.0078125 0.05)
(0.1015625 0.0078125 0.05)
(0.1171875 0.0078125 0.05)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0 0.0078125 0.05)
(0 0.0234375 0.05)
(0 0.0390625 0.05)
(0 0.0546875 0.05)
(0 0.0703125 0.05)
(0 0.0859375 0.05)
(0 0.1015625 0.05)
(0 0.1171875 0.05)
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(2 0.0078125 0.05)
(2 0.0234375 0.05)
(2 0.0390625 0.05)
(2 0.0546875 0.05)
(2 0.0703125 0.05)
(2 0.0859375 0.05)
(2 0.1015625 0.05)
(2 0.1171875 0.05)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0.0078125 0 0.05)
(0.0234375 0 0.05)
(0.0390625 0 0.05)
(0.0546875 0 0.05)
(0.0703125 0 0.05)
(0.0859375 0 0.05)
(0.1015625 0 0.05)
(0.1171875 0 0.05)
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0.0078125 2 0.05)
(0.0234375 2 0.05)
(0.0390625 2 0.05)
(0.0546875 2 0.05)
(0.0703125 2 0.05)
(0.0859375 2 0.05)
(0.1015625 2 0.05)
(0.1171875 2 0.05)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    hole1
    {
        type            calculated;
        value           nonuniform List<vector> 
32
(
(0.9453125 1.125 0.05)
(0.9609375 1.125 0.05)
(0.84375 1.132812 0.05)
(0.84375 1.148437 0.05)
(0.84375 1.164062 0.05)
(0.84375 1.179688 0.05)
(0.84375 1.195312 0.05)
(0.84375 1.210938 0.05)
...
)
;
    }
    hole2
    {
        type            calculated;
        value           nonuniform List<vector> 
32
(
(1.0625 0.9765625 0.05)
(1.0625 0.9921875 0.05)
(1.0625 1.007812 0.05)
(1.0625 1.023438 0.05)
(1.0625 1.039062 0.05)
(1.0625 1.054688 0.05)
(1.0625 1.070312 0.05)
(1.0625 1.085938 0.05)
...
)
;
    }
    hole3
    {
        type            calculated;
        value           nonuniform List<vector> 
32
(
(1.4375 1.445312 0.05)
(1.4375 1.460937 0.05)
(1.4375 1.476562 0.05)
(1.4375 1.492188 0.05)
(1.4375 1.507812 0.05)
(1.4375 1.523438 0.05)
(1.4375 1.539062 0.05)
(1.4375 1.554687 0.05)
...
)
;
    }
    hole4
    {
        type            calculated;
        value           nonuniform List<vector> 
32
(
(1.78125 1.257812 0.05)
(1.78125 1.273438 0.05)
(1.78125 1.289062 0.05)
(1.78125 1.304687 0.05)
(1.78125 1.320312 0.05)
(1.78125 1.335938 0.05)
(1.78125 1.351562 0.05)
(1.90625 1.257812 0.05)
...
)
;
    }
    hole5
    {
        type            calculated;
        value           nonuniform List<vector> 
32
(
(1.109375 1.695312 0.05)
(1.109375 1.710937 0.05)
(1.109375 1.726562 0.05)
(1.109375 1.742188 0.05)
(1.109375 1.757812 0.05)
(1.109375 1.773437 0.05)
(1.109375 1.789062 0.05)
(1.109375 1.804688 0.05)
...
)
;
    }
}


// ************************************************************************* //
