dataset_gen/NS_datasets/LDC/Multiple_Hole/test_Design_Point_0_copy_1/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16064
(
0.0078125
0.0234375
0.0390625
0.0546875
0.0703125
0.0859375
0.1015625
0.1171875
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform 0;
    }
    right
    {
        type            calculated;
        value           uniform 2;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.0078125
0.0234375
0.0390625
0.0546875
0.0703125
0.0859375
0.1015625
0.1171875
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.0078125
0.0234375
0.0390625
0.0546875
0.0703125
0.0859375
0.1015625
0.1171875
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    hole1
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
0.9453125
0.9609375
0.84375
0.84375
0.84375
0.84375
0.84375
0.84375
...
)
;
    }
    hole2
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
1.0625
1.0625
1.0625
1.0625
1.0625
1.0625
1.0625
1.0625
...
)
;
    }
    hole3
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
1.4375
1.4375
1.4375
1.4375
1.4375
1.4375
1.4375
1.4375
...
)
;
    }
    hole4
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
1.78125
1.78125
1.78125
1.78125
1.78125
1.78125
1.78125
1.90625
...
)
;
    }
    hole5
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
1.109375
1.109375
1.109375
1.109375
1.109375
1.109375
1.109375
1.109375
...
)
;
    }
}


// ************************************************************************* //
