dataset_gen/NS_datasets/LDC/Multiple_Hole/test_Design_Point_0_copy_1/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16064
(
0.0078125
0.0078125
0.0078125
0.0078125
0.0078125
0.0078125
0.0078125
0.0078125
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.0078125
0.0234375
0.0390625
0.0546875
0.0703125
0.0859375
0.1015625
0.1171875
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.0078125
0.0234375
0.0390625
0.0546875
0.0703125
0.0859375
0.1015625
0.1171875
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           uniform 2;
    }
    frontAndBack
    {
        type            empty;
    }
    hole1
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
1.125
1.125
1.132812
1.148437
1.164062
1.179688
1.195312
1.210938
...
)
;
    }
    hole2
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
0.9765625
0.9921875
1.007812
1.023438
1.039062
1.054688
1.070312
1.085938
...
)
;
    }
    hole3
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
1.445312
1.460937
1.476562
1.492188
1.507812
1.523438
1.539062
1.554687
...
)
;
    }
    hole4
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
1.257812
1.273438
1.289062
1.304687
1.320312
1.335938
1.351562
1.257812
...
)
;
    }
    hole5
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
1.695312
1.710937
1.726562
1.742188
1.757812
1.773437
1.789062
1.804688
...
)
;
    }
}


// ************************************************************************* //
