dataset_gen/NS_datasets/LDC/Multiple_Hole/test_Design_Point_0_copy_1/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            noSlip;
    }
    right
    {
        type            noSlip;
    }
    bottom
    {
        type            noSlip;
    }
    top
    {
        type            fixedValue;
        value           uniform (0.014221939260320712 0 0);  // Example Umax value (must be set dynamically!)

    }
    hole
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
    hole1
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    hole2
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    hole3
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    hole4
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    hole5
    {
        type fixedValue;
        value uniform (0 0 0);
    }
}
