dataset_gen/NS_datasets/LDC/Multiple_Hole/test_Design_Point_0_copy_1/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    hole
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    hole1
    {
        type zeroGradient;
    }
    hole2
    {
        type zeroGradient;
    }
    hole3
    {
        type zeroGradient;
    }
    hole4
    {
        type zeroGradient;
    }
    hole5
    {
        type zeroGradient;
    }
}
