dataset_gen/NS_datasets/LDC/Multiple_Hole/test_Design_Point_0_copy_1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    left
    {
        type            patch;
        nFaces          128;
        startFace       31792;
    }
    right
    {
        type            patch;
        nFaces          128;
        startFace       31920;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          128;
        startFace       32048;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          128;
        startFace       32176;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32128;
        startFace       32304;
    }
    hole1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32;
        startFace       64432;
    }
    hole2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32;
        startFace       64464;
    }
    hole3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32;
        startFace       64496;
    }
    hole4
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32;
        startFace       64528;
    }
    hole5
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32;
        startFace       64560;
    }
)

// ************************************************************************* //
