dataset_gen/NS_datasets/LDC/Multiple_Hole/test_Design_Point_0_copy_1/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
convertToMeters 1;

vertices
(
    (0 0 0)
    (0.84375 0 0)
    (0.9375 0 0)
    (0.96875 0 0)
    (1.0625 0 0)
    (1.109375 0 0)
    (1.234375 0 0)
    (1.3125 0 0)
    (1.4375 0 0)
    (1.78125 0 0)
    (1.90625 0 0)
    (2 0 0)
    (0 0.96875 0)
    (0.84375 0.96875 0)
    (0.9375 0.96875 0)
    (0.96875 0.96875 0)
    (1.0625 0.96875 0)
    (1.109375 0.96875 0)
    (1.234375 0.96875 0)
    (1.3125 0.96875 0)
    (1.4375 0.96875 0)
    (1.78125 0.96875 0)
    (1.90625 0.96875 0)
    (2 0.96875 0)
    (0 1.09375 0)
    (0.84375 1.09375 0)
    (0.9375 1.09375 0)
    (0.96875 1.09375 0)
    (1.0625 1.09375 0)
    (1.109375 1.09375 0)
    (1.234375 1.09375 0)
    (1.3125 1.09375 0)
    (1.4375 1.09375 0)
    (1.78125 1.09375 0)
    (1.90625 1.09375 0)
    (2 1.09375 0)
    (0 1.125 0)
    (0.84375 1.125 0)
    (0.9375 1.125 0)
    (0.96875 1.125 0)
    (1.0625 1.125 0)
    (1.109375 1.125 0)
    (1.234375 1.125 0)
    (1.3125 1.125 0)
    (1.4375 1.125 0)
    (1.78125 1.125 0)
    (1.90625 1.125 0)
    (2 1.125 0)
    (0 1.234375 0)
    (0.84375 1.234375 0)
    (0.9375 1.234375 0)
    (0.96875 1.234375 0)
    (1.0625 1.234375 0)
    (1.109375 1.234375 0)
    (1.234375 1.234375 0)
    (1.3125 1.234375 0)
    (1.4375 1.234375 0)
    (1.78125 1.234375 0)
    (1.90625 1.234375 0)
    (2 1.234375 0)
    (0 1.25 0)
    (0.84375 1.25 0)
    (0.9375 1.25 0)
    (0.96875 1.25 0)
    (1.0625 1.25 0)
    (1.109375 1.25 0)
    (1.234375 1.25 0)
    (1.3125 1.25 0)
    (1.4375 1.25 0)
    (1.78125 1.25 0)
    (1.90625 1.25 0)
    (2 1.25 0)
    (0 1.359375 0)
    (0.84375 1.359375 0)
    (0.9375 1.359375 0)
    (0.96875 1.359375 0)
    (1.0625 1.359375 0)
    (1.109375 1.359375 0)
    (1.234375 1.359375 0)
    (1.3125 1.359375 0)
    (1.4375 1.359375 0)
    (1.78125 1.359375 0)
    (1.90625 1.359375 0)
    (2 1.359375 0)
    (0 1.4375 0)
    (0.84375 1.4375 0)
    (0.9375 1.4375 0)
    (0.96875 1.4375 0)
    (1.0625 1.4375 0)
    (1.109375 1.4375 0)
    (1.234375 1.4375 0)
    (1.3125 1.4375 0)
    (1.4375 1.4375 0)
    (1.78125 1.4375 0)
    (1.90625 1.4375 0)
    (2 1.4375 0)
    (0 1.5625 0)
    (0.84375 1.5625 0)
    (0.9375 1.5625 0)
    (0.96875 1.5625 0)
    (1.0625 1.5625 0)
    (1.109375 1.5625 0)
    (1.234375 1.5625 0)
    (1.3125 1.5625 0)
    (1.4375 1.5625 0)
    (1.78125 1.5625 0)
    (1.90625 1.5625 0)
    (2 1.5625 0)
    (0 1.6875 0)
    (0.84375 1.6875 0)
    (0.9375 1.6875 0)
    (0.96875 1.6875 0)
    (1.0625 1.6875 0)
    (1.109375 1.6875 0)
    (1.234375 1.6875 0)
    (1.3125 1.6875 0)
    (1.4375 1.6875 0)
    (1.78125 1.6875 0)
    (1.90625 1.6875 0)
    (2 1.6875 0)
    (0 1.8125 0)
    (0.84375 1.8125 0)
    (0.9375 1.8125 0)
    (0.96875 1.8125 0)
    (1.0625 1.8125 0)
    (1.109375 1.8125 0)
    (1.234375 1.8125 0)
    (1.3125 1.8125 0)
    (1.4375 1.8125 0)
    (1.78125 1.8125 0)
    (1.90625 1.8125 0)
    (2 1.8125 0)
    (0 2 0)
    (0.84375 2 0)
    (0.9375 2 0)
    (0.96875 2 0)
    (1.0625 2 0)
    (1.109375 2 0)
    (1.234375 2 0)
    (1.3125 2 0)
    (1.4375 2 0)
    (1.78125 2 0)
    (1.90625 2 0)
    (2 2 0)
    (0 0 0.1)
    (0.84375 0 0.1)
    (0.9375 0 0.1)
    (0.96875 0 0.1)
    (1.0625 0 0.1)
    (1.109375 0 0.1)
    (1.234375 0 0.1)
    (1.3125 0 0.1)
    (1.4375 0 0.1)
    (1.78125 0 0.1)
    (1.90625 0 0.1)
    (2 0 0.1)
    (0 0.96875 0.1)
    (0.84375 0.96875 0.1)
    (0.9375 0.96875 0.1)
    (0.96875 0.96875 0.1)
    (1.0625 0.96875 0.1)
    (1.109375 0.96875 0.1)
    (1.234375 0.96875 0.1)
    (1.3125 0.96875 0.1)
    (1.4375 0.96875 0.1)
    (1.78125 0.96875 0.1)
    (1.90625 0.96875 0.1)
    (2 0.96875 0.1)
    (0 1.09375 0.1)
    (0.84375 1.09375 0.1)
    (0.9375 1.09375 0.1)
    (0.96875 1.09375 0.1)
    (1.0625 1.09375 0.1)
    (1.109375 1.09375 0.1)
    (1.234375 1.09375 0.1)
    (1.3125 1.09375 0.1)
    (1.4375 1.09375 0.1)
    (1.78125 1.09375 0.1)
    (1.90625 1.09375 0.1)
    (2 1.09375 0.1)
    (0 1.125 0.1)
    (0.84375 1.125 0.1)
    (0.9375 1.125 0.1)
    (0.96875 1.125 0.1)
    (1.0625 1.125 0.1)
    (1.109375 1.125 0.1)
    (1.234375 1.125 0.1)
    (1.3125 1.125 0.1)
    (1.4375 1.125 0.1)
    (1.78125 1.125 0.1)
    (1.90625 1.125 0.1)
    (2 1.125 0.1)
    (0 1.234375 0.1)
    (0.84375 1.234375 0.1)
    (0.9375 1.234375 0.1)
    (0.96875 1.234375 0.1)
    (1.0625 1.234375 0.1)
    (1.109375 1.234375 0.1)
    (1.234375 1.234375 0.1)
    (1.3125 1.234375 0.1)
    (1.4375 1.234375 0.1)
    (1.78125 1.234375 0.1)
    (1.90625 1.234375 0.1)
    (2 1.234375 0.1)
    (0 1.25 0.1)
    (0.84375 1.25 0.1)
    (0.9375 1.25 0.1)
    (0.96875 1.25 0.1)
    (1.0625 1.25 0.1)
    (1.109375 1.25 0.1)
    (1.234375 1.25 0.1)
    (1.3125 1.25 0.1)
    (1.4375 1.25 0.1)
    (1.78125 1.25 0.1)
    (1.90625 1.25 0.1)
    (2 1.25 0.1)
    (0 1.359375 0.1)
    (0.84375 1.359375 0.1)
    (0.9375 1.359375 0.1)
    (0.96875 1.359375 0.1)
    (1.0625 1.359375 0.1)
    (1.109375 1.359375 0.1)
    (1.234375 1.359375 0.1)
    (1.3125 1.359375 0.1)
    (1.4375 1.359375 0.1)
    (1.78125 1.359375 0.1)
    (1.90625 1.359375 0.1)
    (2 1.359375 0.1)
    (0 1.4375 0.1)
    (0.84375 1.4375 0.1)
    (0.9375 1.4375 0.1)
    (0.96875 1.4375 0.1)
    (1.0625 1.4375 0.1)
    (1.109375 1.4375 0.1)
    (1.234375 1.4375 0.1)
    (1.3125 1.4375 0.1)
    (1.4375 1.4375 0.1)
    (1.78125 1.4375 0.1)
    (1.90625 1.4375 0.1)
    (2 1.4375 0.1)
    (0 1.5625 0.1)
    (0.84375 1.5625 0.1)
    (0.9375 1.5625 0.1)
    (0.96875 1.5625 0.1)
    (1.0625 1.5625 0.1)
    (1.109375 1.5625 0.1)
    (1.234375 1.5625 0.1)
    (1.3125 1.5625 0.1)
    (1.4375 1.5625 0.1)
    (1.78125 1.5625 0.1)
    (1.90625 1.5625 0.1)
    (2 1.5625 0.1)
    (0 1.6875 0.1)
    (0.84375 1.6875 0.1)
    (0.9375 1.6875 0.1)
    (0.96875 1.6875 0.1)
    (1.0625 1.6875 0.1)
    (1.109375 1.6875 0.1)
    (1.234375 1.6875 0.1)
    (1.3125 1.6875 0.1)
    (1.4375 1.6875 0.1)
    (1.78125 1.6875 0.1)
    (1.90625 1.6875 0.1)
    (2 1.6875 0.1)
    (0 1.8125 0.1)
    (0.84375 1.8125 0.1)
    (0.9375 1.8125 0.1)
    (0.96875 1.8125 0.1)
    (1.0625 1.8125 0.1)
    (1.109375 1.8125 0.1)
    (1.234375 1.8125 0.1)
    (1.3125 1.8125 0.1)
    (1.4375 1.8125 0.1)
    (1.78125 1.8125 0.1)
    (1.90625 1.8125 0.1)
    (2 1.8125 0.1)
    (0 2 0.1)
    (0.84375 2 0.1)
    (0.9375 2 0.1)
    (0.96875 2 0.1)
    (1.0625 2 0.1)
    (1.109375 2 0.1)
    (1.234375 2 0.1)
    (1.3125 2 0.1)
    (1.4375 2 0.1)
    (1.78125 2 0.1)
    (1.90625 2 0.1)
    (2 2 0.1)
);

blocks
(
    hex (0 1 13 12 144 145 157 156) (54 62 1) simpleGrading (1 1 1)
    hex (1 2 14 13 145 146 158 157) (6 62 1) simpleGrading (1 1 1)
    hex (2 3 15 14 146 147 159 158) (2 62 1) simpleGrading (1 1 1)
    hex (3 4 16 15 147 148 160 159) (6 62 1) simpleGrading (1 1 1)
    hex (4 5 17 16 148 149 161 160) (3 62 1) simpleGrading (1 1 1)
    hex (5 6 18 17 149 150 162 161) (8 62 1) simpleGrading (1 1 1)
    hex (6 7 19 18 150 151 163 162) (5 62 1) simpleGrading (1 1 1)
    hex (7 8 20 19 151 152 164 163) (8 62 1) simpleGrading (1 1 1)
    hex (8 9 21 20 152 153 165 164) (22 62 1) simpleGrading (1 1 1)
    hex (9 10 22 21 153 154 166 165) (8 62 1) simpleGrading (1 1 1)
    hex (10 11 23 22 154 155 167 166) (6 62 1) simpleGrading (1 1 1)
    hex (12 13 25 24 156 157 169 168) (54 8 1) simpleGrading (1 1 1)
    hex (13 14 26 25 157 158 170 169) (6 8 1) simpleGrading (1 1 1)
    hex (16 17 29 28 160 161 173 172) (3 8 1) simpleGrading (1 1 1)
    hex (17 18 30 29 161 162 174 173) (8 8 1) simpleGrading (1 1 1)
    hex (18 19 31 30 162 163 175 174) (5 8 1) simpleGrading (1 1 1)
    hex (19 20 32 31 163 164 176 175) (8 8 1) simpleGrading (1 1 1)
    hex (20 21 33 32 164 165 177 176) (22 8 1) simpleGrading (1 1 1)
    hex (21 22 34 33 165 166 178 177) (8 8 1) simpleGrading (1 1 1)
    hex (22 23 35 34 166 167 179 178) (6 8 1) simpleGrading (1 1 1)
    hex (24 25 37 36 168 169 181 180) (54 2 1) simpleGrading (1 1 1)
    hex (25 26 38 37 169 170 182 181) (6 2 1) simpleGrading (1 1 1)
    hex (26 27 39 38 170 171 183 182) (2 2 1) simpleGrading (1 1 1)
    hex (27 28 40 39 171 172 184 183) (6 2 1) simpleGrading (1 1 1)
    hex (28 29 41 40 172 173 185 184) (3 2 1) simpleGrading (1 1 1)
    hex (29 30 42 41 173 174 186 185) (8 2 1) simpleGrading (1 1 1)
    hex (30 31 43 42 174 175 187 186) (5 2 1) simpleGrading (1 1 1)
    hex (31 32 44 43 175 176 188 187) (8 2 1) simpleGrading (1 1 1)
    hex (32 33 45 44 176 177 189 188) (22 2 1) simpleGrading (1 1 1)
    hex (33 34 46 45 177 178 190 189) (8 2 1) simpleGrading (1 1 1)
    hex (34 35 47 46 178 179 191 190) (6 2 1) simpleGrading (1 1 1)
    hex (36 37 49 48 180 181 193 192) (54 7 1) simpleGrading (1 1 1)
    hex (39 40 52 51 183 184 196 195) (6 7 1) simpleGrading (1 1 1)
    hex (40 41 53 52 184 185 197 196) (3 7 1) simpleGrading (1 1 1)
    hex (41 42 54 53 185 186 198 197) (8 7 1) simpleGrading (1 1 1)
    hex (42 43 55 54 186 187 199 198) (5 7 1) simpleGrading (1 1 1)
    hex (43 44 56 55 187 188 200 199) (8 7 1) simpleGrading (1 1 1)
    hex (44 45 57 56 188 189 201 200) (22 7 1) simpleGrading (1 1 1)
    hex (45 46 58 57 189 190 202 201) (8 7 1) simpleGrading (1 1 1)
    hex (46 47 59 58 190 191 203 202) (6 7 1) simpleGrading (1 1 1)
    hex (48 49 61 60 192 193 205 204) (54 1 1) simpleGrading (1 1 1)
    hex (51 52 64 63 195 196 208 207) (6 1 1) simpleGrading (1 1 1)
    hex (52 53 65 64 196 197 209 208) (3 1 1) simpleGrading (1 1 1)
    hex (53 54 66 65 197 198 210 209) (8 1 1) simpleGrading (1 1 1)
    hex (54 55 67 66 198 199 211 210) (5 1 1) simpleGrading (1 1 1)
    hex (55 56 68 67 199 200 212 211) (8 1 1) simpleGrading (1 1 1)
    hex (56 57 69 68 200 201 213 212) (22 1 1) simpleGrading (1 1 1)
    hex (58 59 71 70 202 203 215 214) (6 1 1) simpleGrading (1 1 1)
    hex (60 61 73 72 204 205 217 216) (54 7 1) simpleGrading (1 1 1)
    hex (61 62 74 73 205 206 218 217) (6 7 1) simpleGrading (1 1 1)
    hex (62 63 75 74 206 207 219 218) (2 7 1) simpleGrading (1 1 1)
    hex (63 64 76 75 207 208 220 219) (6 7 1) simpleGrading (1 1 1)
    hex (64 65 77 76 208 209 221 220) (3 7 1) simpleGrading (1 1 1)
    hex (65 66 78 77 209 210 222 221) (8 7 1) simpleGrading (1 1 1)
    hex (66 67 79 78 210 211 223 222) (5 7 1) simpleGrading (1 1 1)
    hex (67 68 80 79 211 212 224 223) (8 7 1) simpleGrading (1 1 1)
    hex (68 69 81 80 212 213 225 224) (22 7 1) simpleGrading (1 1 1)
    hex (70 71 83 82 214 215 227 226) (6 7 1) simpleGrading (1 1 1)
    hex (72 73 85 84 216 217 229 228) (54 5 1) simpleGrading (1 1 1)
    hex (73 74 86 85 217 218 230 229) (6 5 1) simpleGrading (1 1 1)
    hex (74 75 87 86 218 219 231 230) (2 5 1) simpleGrading (1 1 1)
    hex (75 76 88 87 219 220 232 231) (6 5 1) simpleGrading (1 1 1)
    hex (76 77 89 88 220 221 233 232) (3 5 1) simpleGrading (1 1 1)
    hex (77 78 90 89 221 222 234 233) (8 5 1) simpleGrading (1 1 1)
    hex (78 79 91 90 222 223 235 234) (5 5 1) simpleGrading (1 1 1)
    hex (79 80 92 91 223 224 236 235) (8 5 1) simpleGrading (1 1 1)
    hex (80 81 93 92 224 225 237 236) (22 5 1) simpleGrading (1 1 1)
    hex (81 82 94 93 225 226 238 237) (8 5 1) simpleGrading (1 1 1)
    hex (82 83 95 94 226 227 239 238) (6 5 1) simpleGrading (1 1 1)
    hex (84 85 97 96 228 229 241 240) (54 8 1) simpleGrading (1 1 1)
    hex (85 86 98 97 229 230 242 241) (6 8 1) simpleGrading (1 1 1)
    hex (86 87 99 98 230 231 243 242) (2 8 1) simpleGrading (1 1 1)
    hex (87 88 100 99 231 232 244 243) (6 8 1) simpleGrading (1 1 1)
    hex (88 89 101 100 232 233 245 244) (3 8 1) simpleGrading (1 1 1)
    hex (89 90 102 101 233 234 246 245) (8 8 1) simpleGrading (1 1 1)
    hex (90 91 103 102 234 235 247 246) (5 8 1) simpleGrading (1 1 1)
    hex (92 93 105 104 236 237 249 248) (22 8 1) simpleGrading (1 1 1)
    hex (93 94 106 105 237 238 250 249) (8 8 1) simpleGrading (1 1 1)
    hex (94 95 107 106 238 239 251 250) (6 8 1) simpleGrading (1 1 1)
    hex (96 97 109 108 240 241 253 252) (54 8 1) simpleGrading (1 1 1)
    hex (97 98 110 109 241 242 254 253) (6 8 1) simpleGrading (1 1 1)
    hex (98 99 111 110 242 243 255 254) (2 8 1) simpleGrading (1 1 1)
    hex (99 100 112 111 243 244 256 255) (6 8 1) simpleGrading (1 1 1)
    hex (100 101 113 112 244 245 257 256) (3 8 1) simpleGrading (1 1 1)
    hex (101 102 114 113 245 246 258 257) (8 8 1) simpleGrading (1 1 1)
    hex (102 103 115 114 246 247 259 258) (5 8 1) simpleGrading (1 1 1)
    hex (103 104 116 115 247 248 260 259) (8 8 1) simpleGrading (1 1 1)
    hex (104 105 117 116 248 249 261 260) (22 8 1) simpleGrading (1 1 1)
    hex (105 106 118 117 249 250 262 261) (8 8 1) simpleGrading (1 1 1)
    hex (106 107 119 118 250 251 263 262) (6 8 1) simpleGrading (1 1 1)
    hex (108 109 121 120 252 253 265 264) (54 8 1) simpleGrading (1 1 1)
    hex (109 110 122 121 253 254 266 265) (6 8 1) simpleGrading (1 1 1)
    hex (110 111 123 122 254 255 267 266) (2 8 1) simpleGrading (1 1 1)
    hex (111 112 124 123 255 256 268 267) (6 8 1) simpleGrading (1 1 1)
    hex (112 113 125 124 256 257 269 268) (3 8 1) simpleGrading (1 1 1)
    hex (114 115 127 126 258 259 271 270) (5 8 1) simpleGrading (1 1 1)
    hex (115 116 128 127 259 260 272 271) (8 8 1) simpleGrading (1 1 1)
    hex (116 117 129 128 260 261 273 272) (22 8 1) simpleGrading (1 1 1)
    hex (117 118 130 129 261 262 274 273) (8 8 1) simpleGrading (1 1 1)
    hex (118 119 131 130 262 263 275 274) (6 8 1) simpleGrading (1 1 1)
    hex (120 121 133 132 264 265 277 276) (54 12 1) simpleGrading (1 1 1)
    hex (121 122 134 133 265 266 278 277) (6 12 1) simpleGrading (1 1 1)
    hex (122 123 135 134 266 267 279 278) (2 12 1) simpleGrading (1 1 1)
    hex (123 124 136 135 267 268 280 279) (6 12 1) simpleGrading (1 1 1)
    hex (124 125 137 136 268 269 281 280) (3 12 1) simpleGrading (1 1 1)
    hex (125 126 138 137 269 270 282 281) (8 12 1) simpleGrading (1 1 1)
    hex (126 127 139 138 270 271 283 282) (5 12 1) simpleGrading (1 1 1)
    hex (127 128 140 139 271 272 284 283) (8 12 1) simpleGrading (1 1 1)
    hex (128 129 141 140 272 273 285 284) (22 12 1) simpleGrading (1 1 1)
    hex (129 130 142 141 273 274 286 285) (8 12 1) simpleGrading (1 1 1)
    hex (130 131 143 142 274 275 287 286) (6 12 1) simpleGrading (1 1 1)
);

boundary
(
    left
    {
        type    patch;
        faces
        (
            (0 12 156 144)
            (12 24 168 156)
            (24 36 180 168)
            (36 48 192 180)
            (48 60 204 192)
            (60 72 216 204)
            (72 84 228 216)
            (84 96 240 228)
            (96 108 252 240)
            (108 120 264 252)
            (120 132 276 264)
        );
    }
    right
    {
        type    patch;
        faces
        (
            (11 23 167 155)
            (23 35 179 167)
            (35 47 191 179)
            (47 59 203 191)
            (59 71 215 203)
            (71 83 227 215)
            (83 95 239 227)
            (95 107 251 239)
            (107 119 263 251)
            (119 131 275 263)
            (131 143 287 275)
        );
    }
    bottom
    {
        type    wall;
        faces
        (
            (0 1 145 144)
            (1 2 146 145)
            (2 3 147 146)
            (3 4 148 147)
            (4 5 149 148)
            (5 6 150 149)
            (6 7 151 150)
            (7 8 152 151)
            (8 9 153 152)
            (9 10 154 153)
            (10 11 155 154)
        );
    }
    top
    {
        type    wall;
        faces
        (
            (132 133 277 276)
            (133 134 278 277)
            (134 135 279 278)
            (135 136 280 279)
            (136 137 281 280)
            (137 138 282 281)
            (138 139 283 282)
            (139 140 284 283)
            (140 141 285 284)
            (141 142 286 285)
            (142 143 287 286)
        );
    }
    frontAndBack
    {
        type    empty;
        faces
        (
            (0 1 13 12)
            (144 145 157 156)
            (1 2 14 13)
            (145 146 158 157)
            (2 3 15 14)
            (146 147 159 158)
            (3 4 16 15)
            (147 148 160 159)
            (4 5 17 16)
            (148 149 161 160)
            (5 6 18 17)
            (149 150 162 161)
            (6 7 19 18)
            (150 151 163 162)
            (7 8 20 19)
            (151 152 164 163)
            (8 9 21 20)
            (152 153 165 164)
            (9 10 22 21)
            (153 154 166 165)
            (10 11 23 22)
            (154 155 167 166)
            (12 13 25 24)
            (156 157 169 168)
            (13 14 26 25)
            (157 158 170 169)
            (16 17 29 28)
            (160 161 173 172)
            (17 18 30 29)
            (161 162 174 173)
            (18 19 31 30)
            (162 163 175 174)
            (19 20 32 31)
            (163 164 176 175)
            (20 21 33 32)
            (164 165 177 176)
            (21 22 34 33)
            (165 166 178 177)
            (22 23 35 34)
            (166 167 179 178)
            (24 25 37 36)
            (168 169 181 180)
            (25 26 38 37)
            (169 170 182 181)
            (26 27 39 38)
            (170 171 183 182)
            (27 28 40 39)
            (171 172 184 183)
            (28 29 41 40)
            (172 173 185 184)
            (29 30 42 41)
            (173 174 186 185)
            (30 31 43 42)
            (174 175 187 186)
            (31 32 44 43)
            (175 176 188 187)
            (32 33 45 44)
            (176 177 189 188)
            (33 34 46 45)
            (177 178 190 189)
            (34 35 47 46)
            (178 179 191 190)
            (36 37 49 48)
            (180 181 193 192)
            (39 40 52 51)
            (183 184 196 195)
            (40 41 53 52)
            (184 185 197 196)
            (41 42 54 53)
            (185 186 198 197)
            (42 43 55 54)
            (186 187 199 198)
            (43 44 56 55)
            (187 188 200 199)
            (44 45 57 56)
            (188 189 201 200)
            (45 46 58 57)
            (189 190 202 201)
            (46 47 59 58)
            (190 191 203 202)
            (48 49 61 60)
            (192 193 205 204)
            (51 52 64 63)
            (195 196 208 207)
            (52 53 65 64)
            (196 197 209 208)
            (53 54 66 65)
            (197 198 210 209)
            (54 55 67 66)
            (198 199 211 210)
            (55 56 68 67)
            (199 200 212 211)
            (56 57 69 68)
            (200 201 213 212)
            (58 59 71 70)
            (202 203 215 214)
            (60 61 73 72)
            (204 205 217 216)
            (61 62 74 73)
            (205 206 218 217)
            (62 63 75 74)
            (206 207 219 218)
            (63 64 76 75)
            (207 208 220 219)
            (64 65 77 76)
            (208 209 221 220)
            (65 66 78 77)
            (209 210 222 221)
            (66 67 79 78)
            (210 211 223 222)
            (67 68 80 79)
            (211 212 224 223)
            (68 69 81 80)
            (212 213 225 224)
            (70 71 83 82)
            (214 215 227 226)
            (72 73 85 84)
            (216 217 229 228)
            (73 74 86 85)
            (217 218 230 229)
            (74 75 87 86)
            (218 219 231 230)
            (75 76 88 87)
            (219 220 232 231)
            (76 77 89 88)
            (220 221 233 232)
            (77 78 90 89)
            (221 222 234 233)
            (78 79 91 90)
            (222 223 235 234)
            (79 80 92 91)
            (223 224 236 235)
            (80 81 93 92)
            (224 225 237 236)
            (81 82 94 93)
            (225 226 238 237)
            (82 83 95 94)
            (226 227 239 238)
            (84 85 97 96)
            (228 229 241 240)
            (85 86 98 97)
            (229 230 242 241)
            (86 87 99 98)
            (230 231 243 242)
            (87 88 100 99)
            (231 232 244 243)
            (88 89 101 100)
            (232 233 245 244)
            (89 90 102 101)
            (233 234 246 245)
            (90 91 103 102)
            (234 235 247 246)
            (92 93 105 104)
            (236 237 249 248)
            (93 94 106 105)
            (237 238 250 249)
            (94 95 107 106)
            (238 239 251 250)
            (96 97 109 108)
            (240 241 253 252)
            (97 98 110 109)
            (241 242 254 253)
            (98 99 111 110)
            (242 243 255 254)
            (99 100 112 111)
            (243 244 256 255)
            (100 101 113 112)
            (244 245 257 256)
            (101 102 114 113)
            (245 246 258 257)
            (102 103 115 114)
            (246 247 259 258)
            (103 104 116 115)
            (247 248 260 259)
            (104 105 117 116)
            (248 249 261 260)
            (105 106 118 117)
            (249 250 262 261)
            (106 107 119 118)
            (250 251 263 262)
            (108 109 121 120)
            (252 253 265 264)
            (109 110 122 121)
            (253 254 266 265)
            (110 111 123 122)
            (254 255 267 266)
            (111 112 124 123)
            (255 256 268 267)
            (112 113 125 124)
            (256 257 269 268)
            (114 115 127 126)
            (258 259 271 270)
            (115 116 128 127)
            (259 260 272 271)
            (116 117 129 128)
            (260 261 273 272)
            (117 118 130 129)
            (261 262 274 273)
            (118 119 131 130)
            (262 263 275 274)
            (120 121 133 132)
            (264 265 277 276)
            (121 122 134 133)
            (265 266 278 277)
            (122 123 135 134)
            (266 267 279 278)
            (123 124 136 135)
            (267 268 280 279)
            (124 125 137 136)
            (268 269 281 280)
            (125 126 138 137)
            (269 270 282 281)
            (126 127 139 138)
            (270 271 283 282)
            (127 128 140 139)
            (271 272 284 283)
            (128 129 141 140)
            (272 273 285 284)
            (129 130 142 141)
            (273 274 286 285)
            (130 131 143 142)
            (274 275 287 286)
        );
    }
    hole1
    {
        type    wall;
        faces
        (
            (38 39 183 182)
            (37 49 193 181)
            (61 62 206 205)
            (39 51 195 183)
            (37 38 182 181)
            (49 61 205 193)
            (62 63 207 206)
            (51 63 207 195)
        );
    }
    hole2
    {
        type    wall;
        faces
        (
            (16 28 172 160)
            (14 15 159 158)
            (15 16 160 159)
            (27 28 172 171)
            (26 27 171 170)
            (14 26 170 158)
        );
    }
    hole3
    {
        type    wall;
        faces
        (
            (92 104 248 236)
            (103 104 248 247)
            (91 103 247 235)
            (91 92 236 235)
        );
    }
    hole4
    {
        type    wall;
        faces
        (
            (69 81 225 213)
            (70 82 226 214)
            (81 82 226 225)
            (57 69 213 201)
            (58 70 214 202)
            (57 58 202 201)
        );
    }
    hole5
    {
        type    wall;
        faces
        (
            (113 125 269 257)
            (125 126 270 269)
            (113 114 258 257)
            (114 126 270 258)
        );
    }
);

mergePatchPairs
(
);
